goals_project/app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Ctea1bmh66s9mDvv1H4FMQ"], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Ctea1bmh66s9mDvv1H4FMQ"], ["updated_at", "2021-11-17 22:08:36.756544"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = self.class.generate_session_token
        while User.exists?(session_token: self.session_token)
            self.session_token = self.class.generate_session_token
        end
        self.save!